
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПоступлениеГрузов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеГрузов.Дата,
	|	ПоступлениеГрузов.Номер,
	|	ПоступлениеГрузов.Ответственный,
	|	ПоступлениеГрузов.Склад,
	|	ПоступлениеГрузов.ТЧ_Грузы.(
	|		НомерСтроки,
	|		Груз,
	|		Судно,
	|		ДатаПоступления,
	|		СрокХранения
	|	)
	|ИЗ
	|	Документ.ПоступлениеГрузов КАК ПоступлениеГрузов
	|ГДЕ
	|	ПоступлениеГрузов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_ГрузыШапка = Макет.ПолучитьОбласть("ТЧ_ГрузыШапка");
	ОбластьТЧ_Грузы = Макет.ПолучитьОбласть("ТЧ_Грузы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧ_ГрузыШапка);
		ВыборкаТЧ_Грузы = Выборка.ТЧ_Грузы.Выбрать();
		Пока ВыборкаТЧ_Грузы.Следующий() Цикл
			ОбластьТЧ_Грузы.Параметры.Заполнить(ВыборкаТЧ_Грузы);
			ТабДок.Вывести(ОбластьТЧ_Грузы, ВыборкаТЧ_Грузы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
