
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ОтправкаГрузов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтправкаГрузов.Дата,
	|	ОтправкаГрузов.Номер,
	|	ОтправкаГрузов.Ответственный,
	|	ОтправкаГрузов.Склад,
	|	ОтправкаГрузов.ТЧ_Отправка.(
	|		НомерСтроки,
	|		Груз,
	|		Судно,
	|		ДатаОтправлени
	|	)
	|ИЗ
	|	Документ.ОтправкаГрузов КАК ОтправкаГрузов
	|ГДЕ
	|	ОтправкаГрузов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_ОтправкаШапка = Макет.ПолучитьОбласть("ТЧ_ОтправкаШапка");
	ОбластьТЧ_Отправка = Макет.ПолучитьОбласть("ТЧ_Отправка");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧ_ОтправкаШапка);
		ВыборкаТЧ_Отправка = Выборка.ТЧ_Отправка.Выбрать();
		Пока ВыборкаТЧ_Отправка.Следующий() Цикл
			ОбластьТЧ_Отправка.Параметры.Заполнить(ВыборкаТЧ_Отправка);
			ТабДок.Вывести(ОбластьТЧ_Отправка, ВыборкаТЧ_Отправка.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
