
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УчетГрузов Расход
	Движения.УчетГрузов.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Отправка Из ТЧ_Отправка Цикл
		Движение = Движения.УчетГрузов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Груз = ТекСтрокаТЧ_Отправка.Груз;
		Движение.Количество = 0;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
